Scalacalc
=========
A small calculator written in Scala. It has support for Integers, Doubles and
Rationals and a small set of built in functions, with the ability to define your
own functions. Functions can be dispatched by arity, so you can define multiple
functions with the same name.

Example:
```
> 4 * 5
20.0
> x = 2/4
0.5
> x * 7
3.5
> log(2, 8)
3
> square(x) = x * x
(x) = *(x, x)
> square(5)
25
```
